{
    "config": {
        "abort": {
            "single_instance_allowed": "Επιτρέπεται μόνο μία διαμόρφωση των αισθητήρων LGE SmartThinQ.",
            "no_smartthinq_devices": "Δεν βρέθηκαν συσκευές SmartThinQ. Η ρύθμιση στοιχείων ματαιώθηκε.",
            "unsupported_version": "Αυτή η ενσωμάτωση απαιτεί τουλάχιστον την έκδοση HomeAssistant {req_ver}, εκτελείτε την έκδοση {run_ver}.",
            "reconfigured": "Configuration successfully completed."
        },
        "error": {
            "error_connect": "Σφάλμα σύνδεσης στο SmartThinQ. Δοκιμάστε ξανά και βεβαιωθείτε ότι έχετε πρόσβαση στην εφαρμογή ThinQ στο τηλέφωνό σας.",
            "error_url": "Σφάλμα κατά την ανάκτηση της διεύθυνσης URL σύνδεσης από το ThinQ.",
            "invalid_region": "Μη έγκυρη μορφή περιοχής.",
            "invalid_language": "Μη έγκυρη μορφή γλώσσας.",
            "invalid_url": "Μη έγκυρη διεύθυνση URL ανακατεύθυνσης. Βεβαιωθείτε ότι έχετε πρόσβαση στην εφαρμογή ThinQ στο τηλέφωνό σας.",
            "invalid_credentials": "Μη έγκυρα διαπιστευτήρια SmartThinQ. Χρησιμοποιήστε την εφαρμογή LG App στην κινητή συσκευή σας για να ελέγξετε αν υπάρχουν όροι παροχής υπηρεσιών που πρέπει να αποδεχτείτε. Οι λογαριασμοί που βασίζονται σε κοινωνικό δίκτυο δεν υποστηρίζονται και στις περισσότερες περιπτώσεις δεν λειτουργούν με αυτή την ενσωμάτωση.",
            "invalid_config": "Βρέθηκε άκυρη διαμόρφωση, παρακαλούμε επαναδιαμορφώστε την.",
            "no_user_info": "Απαιτείται όνομα χρήστη και κωδικός πρόσβασης.",
            "unknown": "Άγνωστο σφάλμα."
        },
        "step": {
            "user": {
                "data": {
                    "username": "Όνομα χρήστη λογαριασμού LG",
                    "password": "Κωδικός πρόσβασης",
                    "region": "Κωδικός χώρας",
                    "language": "Κωδικός γλώσσας",
                    "use_redirect": "Χρήση μεθόδου ελέγχου ταυτότητας ανακατεύθυνσης URL",
                    "use_ha_session": "Μοιραστείτε τη σύνδεση HTTP του Home Assistant (μπορεί να προκαλέσει σφάλματα SSL)",
                    "use_tls_v1": "Βίαιη χρήση του πρωτοκόλλου TLSv1 (μερικές φορές απαιτείται)",
                    "exclude_dh": "Μην χρησιμοποιείτε το DH cypher (σε περίπτωση σφάλματος όπου 'το κλειδί dh είναι πολύ μικρό΄)"
                },
                "description": "Επιλέξτε τις πληροφορίες τοπικής προσαρμογής του λογαριασμού SmartThinQ."
            },
            "url": {
                "data": {
                    "login_url": "Διεύθυνση URL σύνδεσης SmartThinQ",
                    "callback_url": "Διεύθυνση URL ανακατεύθυνσης"
                },
                "description": "Χρησιμοποιήστε τη διεύθυνση URL στο πρώτο πεδίο για να εκτελέσετε τη σύνδεση στο SmartThinQ με τα διαπιστευτήριά σας και, στη συνέχεια, επικολλήστε τη διεύθυνση URL όπου το πρόγραμμα περιήγησης ανακατευθύνεται μετά τη σύνδεση στο δεύτερο πεδίο. Μοιραστείτε σχόλια σχετικά με τη ρύθμιση [εδώ](https://git.io/JU166).",
                "title": "Αισθητήρες LGE SmartThinQ - Έλεγχος ταυτότητας"
            },
            "token": {
                "data": {
                    "token": "Ανανέωση διακριτικού"
                },
                "description": "Αποθηκεύστε το διακριτικό που δημιουργήθηκε για μελλοντική χρήση και, στη συνέχεια, επιβεβαιώστε για να ολοκληρώσετε τη ρύθμιση παραμέτρων.",
                "title": "SmartThinQ LGE Αισθητήρες - Νέο διακριτικό ανανέωσης"
            }
        },
        "title": "SmartThinQ LGE Αισθητήρες"
    }
}
